# Update the Value and access any cell or rows value

In [1]:
import pandas as pd

# Sample data dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [50000, 60000, 70000, 80000],
    'Perfomance Score': [78, 50, 90, 80]
}

# Convert the dictionary into two DataFrames
df1 = pd.DataFrame(data)
df1

      Name  Age         City  Salary  Perfomance Score
0    Alice   25     New York   50000                78
1      Bob   30  Los Angeles   60000                50
2  Charlie   35      Chicago   70000                90
3    David   40      Houston   80000                80

# Access row cell and Change value or update value

In [2]:
# df1.loc[row_index, 'Column_Name'] = new_value 0r updated value 

df1.loc[2,'Age'] = 50
df1

      Name  Age         City  Salary  Perfomance Score
0    Alice   25     New York   50000                78
1      Bob   30  Los Angeles   60000                50
2  Charlie   50      Chicago   70000                90
3    David   40      Houston   80000                80

# Update exiting Column

In [3]:
# salary increase with 5% 
df1['Salary'] = df1['Salary'] * 
df1

SyntaxError: invalid syntax (3894135694.py, line 2)

In [31]:
df1

      Name  Age         City  Salary  Perfomance Score
0    Alice   25     New York   500.0                78
1      Bob   30  Los Angeles   600.0                50
2  Charlie   35      Chicago   700.0                90
3    David   40      Houston   800.0                80